---
kind: type
id: T:Autodesk.Revit.DB.RevisionSettings
source: html/599f75fc-d2b6-63b3-7295-0c314415b638.htm
---
# Autodesk.Revit.DB.RevisionSettings

Provides access to project-wide settings related to revisions.

## Syntax (C#)
```csharp
public class RevisionSettings : Element
```

## Remarks
This class provides access to the project-wide settings that affect the appearance and numbering of revisions
 and revision clouds. The settings are only available in project documents.